// Задача на тему "Створення класу та використання гетерів та сетерів":

// Створити клас "Користувач", який містить наступні властивості:

// Ім'я
// Прізвище
// Вік
// Електронна пошта
// Також потрібно створити гетери та сетери для віку та електронної пошти.

// У методі конструктора потрібно перевірити, щоб вік користувача був в межах від 18 до 120 років. Якщо вік не задовольняє ці умови, то потрібно встановити його значення за замовчуванням на 18 років.

// Після створення об'єкту класу "Користувач", потрібно вивести на екран інформацію про цього користувача за допомогою методу "printInfo()", який виводить на екран всі властивості користувача.

// Також потрібно створити метод "changeEmail()", який дозволяє змінити електронну пошту користувача. Перевірити, щоб нова електронна пошта була коректною, тобто містила символ "@".

// Використати створений клас та його методи для створення об'єкту користувача з віком 25 років та виведення на екран інформації про цього користувача. Потім викликати метод "changeEmail()" та змінити електронну пошту користувача на "test@example.com". Вивести на екран інформацію про користувача після зміни електронної пошти.

class User {
  constructor({ name, surname, age, mail } = {}) {
    this._name = name;
    this._surname = surname;
    age <= 120 && age >= 18 ? (this._age = age) : (this._age = 18);
    this._mail = mail;
  }

  printInfo() {
    console.log(
      ` ${this._name} ${this._surname} \n ${this._age} \n ${this._mail}`
    );
  }
  changeEmail(arg) {
    arg.includes("@") ? (this._mail = arg) : (this._mail = this._mail);
  }
}

const user2 = new User({
  name: "Петро",
  surname: "Петрович",
  age: 23,
  mail: "abcd@gmail.com",
});

user2.printInfo();
user2.changeEmail("test@example.com");
user2.printInfo();

// Завдання: Створіть клас "Клієнт" з
// властивостями "ім'я", "прізвище", "баланс"
// та методом "повна назва", який повертає повне ім'я клієнта (ім'я та прізвище).
// Також, створіть геттер та сеттер для властивості "баланс",
// який забезпечує можливість читання та зміни значення балансу.

class Client {
  constructor({ name, surname, balance }) {
    this._name = name;
    this._surname = surname;
    this._balance = balance;
  }

  fullname() {
    return `${this._name} ${this._surname}`;
  }

  get balance() {
    return this._balance;
  }
  set balance(arg) {
    arg >= 0 ? this._balance = arg : this._balance = this._balance;
  }
}

const clent = new Client({ name: "John", surname: "Doe", balance: 10000 });
console.log(clent.fullname());